package Chapter2;
//Задание 2.1
//        Напишите класс, который выводит на экран надпись "Hello, world!"
public class Ex2_1 {
    public static void main(String[] args) {
        System.out.println("Hello, world!");
    }
}
