package Chapter2;
//Задание 2.3
//        Напишите класс, который выводит на экран в первой строке три знака
//        «+»,во второй - четыре знака«!», в третьей - два знака«?».
public class Ex2_3 {
    public static void main(String[] args) {
        System.out.println("+++");
        System.out.println("!!!!");
        System.out.println("??");
    }
}
