package Chapter2;
//Задание 2.8
//        Напишите класс, который присваивает переменной х значение 6, а затем
//        выводит на экран: в первой строке - это значение, во второй -
//        квадрат этого значения, в третьей - куб этого значения.
public class Ex2_8 {
    public static void main(String[] args) {
        int x = 6;
        System.out.println(x);
        System.out.println(x*x);
        System.out.println(x*x*x);
    }
}
