package Chapter2;
//Задание 2.2
//        Напишите класс, который выводит на экран надпись
//        "H-e-1-1-o-,-f-r-i-e-n-d!"
public class Ex2_2 {
    public static void main(String[] args) {
        System.out.println("H-e-1-1-o-,-f-r-i-e-n-d!");
    }
}
