package Chapter2;

//Задание 2.10
//        Напишите класс, который присваивает двум переменным значения, а
//        затем выводит на экран: в первой строке значения обеих переменных
//        (с поясняющими надписями), во второй - произведение этих переменных
//        (с поясняющей надписью), в третьей - сумму этих переменных
//        (с поясняющей надписью).
public class Ex2_10 {

    public static void main(String[] args) {
        int x = 2, y = 3;
        System.out.println("Значение первой переменной = " + x + ", значение второй переменной = " + y);
        System.out.println("Произведение этих переменных = " + x * y);
    }

}
