package Chapter12;

import java.util.Scanner;

//Задание 12.6
//        Напишите класс, который принимает с клавиатуры целое число и проверяет,
//        на какое количество двузначных чисел оно делится.
//        Результат проверки класс должен вывести на экран вместе с соответствующим
//        текстовым сообщением.
public class Ex12_6 {
    public static void main(String[] args) {
        System.out.println("Делиться на бесконечно количество");
    }
}
