package Chapter12;
//Задание 12.11
//        Для того чтобы определить, сколько учеников готовы поехать на экскурсию,
//        в школе провели опрос. Каждый из 200 учеников отметил в опроснике:
//        «1»- если он готов поехать на экскурсию, «О» - если не готов.
//        Напишите класс, который принимает с клавиатуры ответы учеников и
//        определяет количество учеников, готовых поехать на экскурсию. Кроме
//        того, класс должен определить, поедет ли на экскурсию большинство
//        участвовавших в опросе учеников или нет.
public class Ex12_11 {
    // аналог не интересно
}
