package Chapter19;
//Задание 19.15
//        Напишите метод, который получает в качестве параметра массив и дополнительный
//        параметр S. Метод сначала заполняет четные ячейки массива
//        двузначными положительными случайными числами. Затем нечетные
//        ячейки метод заполняет так, чтобы сумма значений в нечетной ячейке
//        и в предшествующей ей четной ячейке была равна S. Каким условиям
//        должен отвечать параметр S для того, чтобы задача имела решение?
public class Ex19_15 {
    public static void main(String[] args) {

    }
}
