package Chapter19;
//Задание 19.69
//        Напишите метод, который принимает два параметра:
//        • положительное число R, которое равно радиусу окружности с центром
//        в начале координат;
//        • массив четного размера, пары ячеек которого (первая и вторая,
//        третья и четвертая, пятая и шестая ... и так далее) содержат координаты
//        (Х и У) точек.
//        Метод должен определить точки, лежащие на окружности радиуса R
//        с центром в начале координат, и вернуть массив этих точек.
public class Ex19_68 {
    public static void main(String[] args) {

    }
}
