package Chapter5;
//Задание 5.1
//        Переменные, используемые в задании, инициированы следующим образом:
//        int а=О, Ь=-3, с=9;
//        Заполните таблицы (в столбце Значение выражения следует написать
//        false или tme):

//(а+Ь)3==-9 result:
//Ьа==с(-а) result:
//с/Ь==Ь(-1) result:
//(-Ь)(-Ь)>=с result:
//Ь/{-с)== 1/Ь result:
//80>=80 result:
//ЬЬ!=ас result:
//Ь<а result:
//ЬЬ==с result:
//-с/Ь==-Ь result:

public class Ex5_1 {
    public static void main(String[] args) {
        int а = 0, Ь = -3, с = 9;
//        System.out.println((а + Ь) * 3 == -9); //true
//        System.out.println(Ь * а == с * (-а)); //true
//        System.out.println(с / Ь == Ь * (-1)); // false
//        System.out.println((-Ь) * (-Ь) >= с); //true
//        System.out.println(Ь / (-с) == 1 / Ь); // true
//        System.out.println(80 >= 80); //true
//        System.out.println(Ь * Ь != а * с); // true
//        System.out.println(Ь < а); // true
//        System.out.println(Ь * Ь == с); // true
//        System.out.println(-с / Ь == -Ь); // true
    }
}
