package Chapter13;
//Задание 13.1
//        Дан следующий фрагмент класса:
//        int sl =О;
//        int s2 =О;
//        for(int i = 1; i <7; i++)
//        {
//        }
//        int x=reader.nextlnt();
//        if( х % 2 ==O)sl=sl+x;
//        if( х % 3 ==O)s2=s2+x;
//        Проследите за выполнением фрагмента и запишите, какими будут
//        значения переменных sl и s2 для следующего набора вводимых данных
//        после его окончания: 5, 12, 6, 8, 9, 7.
public class Ex13_1 {
}
