package Chapter15;

//Задание 15.4
//        Напишите класс, который принимает с клавиатуры числа, пока не будет
//        введено значение О. Для каждого введенного с клавиатуры положительного
//        числа класс должен выводить на экран текст Плюс, для
//        каждого отрицательного - текст Минус.

import java.util.Scanner;

public class Ex15_4 {
    static Scanner reader = new Scanner(System.in);

    public static void main(String[] args) {

//        мой вариант
//        while (true){
//            int a = reader.nextInt();
//            if (a==0){
//                break;
//            }
//            if (a>0){
//                System.out.println("Плюс");
//            }
//            if (a<0){
//                System.out.println("Минус");
//            }
//        }
//        решение из книги
//        int x = reader.nextInt();
//        while (x!=0){
//            if(x>0){
//                System.out.println("Плюс");
//            }
//            if(x<0){
//                System.out.println("Минус");
//            }
//            x = reader.nextInt();
//        }

    }
}
