package Chapter14;

//Задание 14.4
//        Напишите класс, который генерирует серию из 50 случайных целых
//        чисел из диапазона от -40 до +40, и определяет наибольшее из положительных
//        значений в сгенерированной серии, а также наименьшее из
//        отрицательных значений в сгенерированной серии.
//        В случае если одно из нужных значений невозможно определить
//        (почему?}, следует вывести на экран соответствующее текстовое сообщение.
public class Ex14_4 {
    public static void main(String[] args) {
//        int down = -40, up = 40;
//        int a = down + (int) ((up - down + 1) * Math.random());
//        int max = a, min = a;
//        for (int i = 1; i <= 50; i++) {
//            int random = down + (int) ((up - down + 1) * Math.random());
//            System.out.print(random + " ");
//            if (random > max) max = random;
//            if (random < min) min = random;
//        }
//        System.out.println();
//        System.out.println("Максимальное число " + max);
//        System.out.println("Минимальное число " + min);

//        и чем оно отличается от 14_3?
    }
}

